XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/can_reg.h
/* 0x48 : Identifier 2, ID20~13, SFF Only use ID20~18 */
#define CAN_IDENTIFIER_2_OFFSET (0x48)

/* 0x4C : Identifier 3, ID12~5, only for EFF */
#define CAN_IDENTIFIER_3_OFFSET (0x4C)

/* 0x50 : Identifier 4, ID4~0, only for EFF */
#define CAN_IDENTIFIER_4_OFFSET (0x50)

/* 0x4C : Standard Format Data 1 buffer */
#define CAN_SFF_DATA_1_OFFSET (0x4C)

/* 0x50 : Standard Format Data 2 buffer */
#define CAN_SFF_DATA_2_OFFSET (0x50)

/* 0x54 : Standard Format Data 3 buffer */
#define CAN_SFF_DATA_3_OFFSET (0x54)

/* 0x58 : Standard Format Data 4 buffer */
#define CAN_SFF_DATA_4_OFFSET (0x58)

/* 0x5C : Standard Format Data 5 buffer */
#define CAN_SFF_DATA_5_OFFSET (0x5C)

/* 0x60 : Standard Format Data 6 buffer */
#define CAN_SFF_DATA_6_OFFSET (0x60)

/* 0x64 : Standard Format Data 7 buffer */
#define CAN_SFF_DATA_7_OFFSET (0x64)

/* 0x68 : Standard Format Data 8 buffer */
#define CAN_SFF_DATA_8_OFFSET (0x68)

/* 0x54 : Extended Format Data 1 buffer */
#define CAN_EFF_DATA_1_OFFSET (0x54)

/* 0x58 : Extended Format Data 2 buffer */
#define CAN_EFF_DATA_2_OFFSET (0x58)

/* 0x5C : Extended Format Data 3 buffer */
#define CAN_EFF_DATA_3_OFFSET (0x5C)

/* 0x60 : Extended Format Data 4 buffer */
#define CAN_EFF_DATA_4_OFFSET (0x60)

/* 0x64 : Extended Format Data 5 buffer */
#define CAN_EFF_DATA_5_OFFSET (0x64)

/* 0x68 : Extended Format Data 6 buffer */
#define CAN_EFF_DATA_6_OFFSET (0x68)

/* 0x6C : Extended Format Data 7 buffer */
#define CAN_EFF_DATA_7_OFFSET (0x6C)

/* 0x70 : Extended Format Data 8 buffer */
#define CAN_EFF_DATA_8_OFFSET (0x70)

/* 0x70 : Extended Format Data 8 buffer */
#define CAN_EFF_DATA_8_OFFSET (0x70)

/* 0x40 : Filter Acceptance 0 */
#define CAN_FILTER_ACCEPTANCE_0_OFFSET (0x40)

/* 0x44 : Filter Acceptance 1 */
#define CAN_FILTER_ACCEPTANCE_1_OFFSET (0x44)

/* 0x48 : Filter Acceptance 2 */
#define CAN_FILTER_ACCEPTANCE_2_OFFSET (0x48)

/* 0x4C : Filter Acceptance 3 */
#define CAN_FILTER_ACCEPTANCE_3_OFFSET (0x4C)

/* 0x50 : Filter Mask 0 */
#define CAN_FILTER_Mask_0_OFFSET (0x50)

/* 0x54 : Filter Mask 1 */
#define CAN_FILTER_Mask_1_OFFSET (0x54)

/* 0x58 : Filter Mask 2 */
#define CAN_FILTER_Mask_2_OFFSET (0x58)

/* 0x5C : Filter Mask 3 */
#define CAN_FILTER_Mask_3_OFFSET (0x5C)

/* 0x4C : Extended Format, Tx information 5, ID4~0 */
#define CAN_IDENTIFIER_4_OFFSET (0x50)

struct can_reg {
    /* 0x0 : op mode:rw        reset mode:rw */
    union {
        struct {
            uint32_t reset_request     : 1;  /* [    0],        w1c,        0x0 */
            uint32_t listen_only       : 1;  /* [    1],        w1c,        0x0 */
            uint32_t selt_test         : 1;  /* [    2],        w1c,        0x0 */
            uint32_t acceptance_filter : 1;  /* [    3],        w1c,        0x0 */
            uint32_t rsvd_7_4          : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mode;

    /* 0x4 : op mode:w        r  ->  8'h00
reset mode:w    r   -> 8'h00 */
    union {
        struct {
            uint32_t transmit_request       : 1;  /* [    0],        w1c,        0x0 */
            uint32_t abort_transmission     : 1;  /* [    1],        w1c,        0x0 */
            uint32_t release_receive_buffer : 1;  /* [    2],        w1c,        0x0 */
            uint32_t clear_data_overrun     : 1;  /* [    3],        w1c,        0x0 */
            uint32_t self_request           : 1;  /* [    4],        w1c,        0x0 */
            uint32_t rsvd_7_5               : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t reserved_8_31          : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } command;

    /* 0x8 : op mode:r       reset mode:r */
    union {
        struct {
            uint32_t receive_buffer_sts    : 1;  /* [    0],          r,        0x0 */
            uint32_t data_overrun_sts      : 1;  /* [    1],          r,        0x0 */
            uint32_t transmit_buffer_sts   : 1;  /* [    2],          r,        0x0 */
            uint32_t transmit_complete_sts : 1;  /* [    3],          r,        0x0 */
            uint32_t receive_sts           : 1;  /* [    4],          r,        0x0 */
            uint32_t transmit_sts          : 1;  /* [    5],          r,        0x0 */
            uint32_t error_sts             : 1;  /* [    6],          r,        0x0 */
            uint32_t bus_sts               : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } status;

    /* 0xc : op mode:r        reset mode:r      when be read,all bits are reseted and can_int disappear */
    union {
        struct {
            uint32_t receive_int       : 1;  /* [    0],          r,        0x0 */
            uint32_t transmit_int      : 1;  /* [    1],          r,        0x0 */
            uint32_t error_int         : 1;  /* [    2],          r,        0x0 */
            uint32_t data_overrun_int  : 1;  /* [    3],          r,        0x0 */
            uint32_t rsvd_4            : 1;  /* [    4],       rsvd,        0x0 */
            uint32_t error_passive_int : 1;  /* [    5],          r,        0x0 */
            uint32_t arb_lost_int      : 1;  /* [    6],          r,        0x0 */
            uint32_t bus_error_int     : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } interrupt;

    /* 0x10 : op mode:rw        reset mode:rw      when be read,all bits are reseted and can_int disappear */
    union {
        struct {
            uint32_t receive_int_en       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t transmit_int_en      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t error_int_en         : 1;  /* [    2],        r/w,        0x0 */
            uint32_t data_overrun_int_en  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t rsvd_4               : 1;  /* [    4],       rsvd,        0x0 */
            uint32_t error_passive_int_en : 1;  /* [    5],        r/w,        0x0 */
            uint32_t arb_lost_int_en      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t bus_error_int_en     : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_31        : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } interrupt_enable;

    /* 0x14  reserved */
    uint8_t RESERVED0x14[4];

    /* 0x18 : op mode:r   reset mode:rw */
    union {
        struct {
            uint32_t baud_rate_prescaler_0 : 1;  /* [    0],        r/w,        0x0 */
            uint32_t baud_rate_prescaler_1 : 1;  /* [    1],        r/w,        0x0 */
            uint32_t baud_rate_prescaler_2 : 1;  /* [    2],        r/w,        0x0 */
            uint32_t baud_rate_prescaler_3 : 1;  /* [    3],        r/w,        0x0 */
            uint32_t baud_rate_prescaler_4 : 1;  /* [    4],        r/w,        0x0 */
            uint32_t baud_rate_prescaler_5 : 1;  /* [    5],        r/w,        0x0 */
            uint32_t sync_jump_width_0     : 1;  /* [    6],        r/w,        0x0 */
            uint32_t sync_jump_width_1     : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bus_timing_0;

    /* 0x1c : op mode:r  reset mode:rw */
    union {
        struct {
            uint32_t time_segment_1_0 : 1;  /* [    0],        r/w,        0x0 */
            uint32_t time_segment_1_1 : 1;  /* [    1],        r/w,        0x0 */
            uint32_t time_segment_1_2 : 1;  /* [    2],        r/w,        0x0 */
            uint32_t time_segment_1_3 : 1;  /* [    3],        r/w,        0x0 */
            uint32_t time_segment_2_0 : 1;  /* [    4],        r/w,        0x0 */
            uint32_t time_segment_2_1 : 1;  /* [    5],        r/w,        0x0 */
            uint32_t time_segment_2_2 : 1;  /* [    6],        r/w,        0x0 */
            uint32_t sampling         : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bus_timing_1;

